In [3]:
import pandas as pd

data1 = {'c1':['A','B','C'],'c2':[1,2,3]}
data2 = {'c1':['A','B','D'],'c3':['T','H','T']}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [4]:
df1

  c1  c2
0  A   1
1  B   2
2  C   3

In [5]:
df2

  c1 c3
0  A  T
1  B  H
2  D  T

### Standard joins using merge

### pd.merge(df1,df2,how='left/right/inner/outer',on='col')

In [6]:
# Join matching rows from df2 to df1.

pd.merge(df1,df2,
        how = 'left', on = 'c1')

  c1  c2   c3
0  A   1    T
1  B   2    H
2  C   3  NaN

In [7]:
# Join matching rows from df1 to df2.

pd.merge(df1,df2,
        how = 'right', on = 'c1')

  c1   c2 c3
0  A  1.0  T
1  B  2.0  H
2  D  NaN  T

In [8]:
# Join data and retain only rows in both sets.

pd.merge(df1,df2,
        how = 'inner', on = 'c1')

  c1  c2 c3
0  A   1  T
1  B   2  H

In [9]:
# Join data and retain all values/columns, all rows

pd.merge(df1,df2,
        how = 'outer', on = 'c1')

  c1   c2   c3
0  A  1.0    T
1  B  2.0    H
2  C  3.0  NaN
3  D  NaN    T

### Filtering joins

### df1[joincond] => df1[df1.col11.isin(df2,col1)]

In [10]:
df1[df1.c1.isin(df2.c1)] # All rows in df1 that have a match in df2.

  c1  c2
0  A   1
1  B   2

### df1[\~joincond] => df1[~df1.col11.isin(df2,col1)]

In [11]:
df1[~df1.c1.isin(df2.c1)] # All rows in df1 that do not have a match in df2.

  c1  c2
2  C   3

### join

#### df1.join(df2, how='')

In [17]:
data1 = {'c1': ['A', 'B', 'C'], 'c2': [1, 2, 3]}
data2 = {'c3': ['A', 'B', 'D'], 'c4': ['T', 'H', 'T']}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

df1.join(df2,how='outer')

  c1  c2 c3 c4
0  A   1  A  T
1  B   2  B  H
2  C   3  D  T

In [21]:
data1 = {'c1':['A','B','C'],'c2':[1,2,3]}
data2 = {'c1':['A','B','D'],'c3':['T','H','T']}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

df1.join(df2,how='outer', lsuffix='_df1', rsuffix='_df2')

  c1_df1  c2 c1_df2 c3
0      A   1      A  T
1      B   2      B  H
2      C   3      D  T